Ryzobee/ryzobee-firmware/firmware/rootmaker/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_40M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
# CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP is not set
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_40M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
# Audit-only application BSS attributes plus the SDK's supported lwIP,
# Wi-Fi and BLE Host BSS mappings. DMA, task stacks and our locks stay internal.
# Check actual linked placement with tools/check_psram_layout.py after build.
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
# BLE + Wi-Fi coexistence: SDK S3 quad-PSRAM memory-saving RX/TX pool sizes.
# PSRAM preference requires static DMA TX. Freeze counts instead of accepting
# the larger PSRAM defaults; retain the existing six-packet RX BA window.
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_ESP_WIFI_STATIC_TX_BUFFER=y
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=32
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=32
CONFIG_ESP_WIFI_RX_BA_WIN=6
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_FREERTOS_HZ=1000
# Chip LOAD uses the two idle-task counters, not idle-loop calibration. The
# 64-bit ESP_TIMER source avoids the SDK's unprotected U32 runtime wrap.
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_RUN_TIME_STATS_USING_ESP_TIMER=y
CONFIG_FREERTOS_RUN_TIME_COUNTER_TYPE_U64=y
CONFIG_LWIP_SNTP_MAX_SERVERS=1
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LOG_DYNAMIC_LEVEL_CONTROL=y
CONFIG_LUA_MAXSTACK=8192

# LVGL is a private renderer behind the bounded Lua `ui` Module. Keep the
# footprint deterministic: RGB565, one software draw unit, no OS integration,
# only the label widget and the two readable 240x240 font sizes used by V1.
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_CONF_MINIMAL=y
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_USE_BUILTIN_MALLOC=y
CONFIG_LV_MEM_SIZE_KILOBYTES=64
CONFIG_LV_OS_NONE=y
CONFIG_LV_DRAW_BUF_ALIGN=4
CONFIG_LV_DRAW_BUF_STRIDE_ALIGN=1
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=1
CONFIG_LV_DRAW_SW_SUPPORT_RGB565=y
CONFIG_LV_DRAW_SW_COMPLEX=y
CONFIG_LV_USE_LABEL=y
CONFIG_LV_USE_IMAGE=y
# Home FPS consumes the official LVGL sysmon result, sampled by the UI owner
# every second. The built-in overlay is hidden before the first flush.
CONFIG_LV_USE_OBSERVER=y
CONFIG_LV_USE_SYSMON=y
CONFIG_LV_USE_PERF_MONITOR=y
# CONFIG_LV_USE_PERF_MONITOR_LOG_MODE is not set
# System labels include Teko's U+00B0 degree sign; Lua's text policy stays ASCII.
CONFIG_LV_TXT_ENC_UTF8=y
# CONFIG_LV_TXT_ENC_ASCII is not set
# CONFIG_LV_LABEL_TEXT_SELECTION is not set
# CONFIG_LV_LABEL_LONG_TXT_HINT is not set
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_RYZ_LUA_FREETYPE=n

# C-owned single-peer BLE. Custom verified single-blob store; never allow
# SDK privacy setup or sample store code to replace its callbacks.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
# Full RootMaker: internal-only HCI pools failed with largest block 7680 B.
# Move Host allocations only; controller/DMA/task stacks remain internal.
CONFIG_BT_NIMBLE_MEM_ALLOC_MODE_EXTERNAL=y
# IDF 5.5.4 gates GATT client procedures behind the Central build option.
# RyzoBee remains a GAP Peripheral: no outgoing connect/scan API is exposed.
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_GATT_CLIENT=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_MAX_BONDS=1
CONFIG_BT_NIMBLE_SECURITY_ENABLE=y
CONFIG_BT_NIMBLE_SM_LEGACY=n
CONFIG_BT_NIMBLE_SM_SC=y
CONFIG_BT_NIMBLE_SM_SC_ONLY=1
CONFIG_BT_NIMBLE_SM_LVL=3
CONFIG_BT_NIMBLE_SM_SC_DEBUG_KEYS=n
CONFIG_BT_NIMBLE_NVS_PERSIST=n
CONFIG_BT_NIMBLE_STATIC_TO_DYNAMIC=n
CONFIG_BT_NIMBLE_HANDLE_REPEAT_PAIRING_DELETION=n
